ArtMoney Plugin
8.17
Traducere realizata de:
Mihai V.
mihai@amgd.ro
Despre
Program de trisat la jocuri
<d> <ms>, <yyyy>//date format
Copyright (C) 1996-2021, System SoftLab
Dacă descoperiți erori sau
aveți sugestii, trimiteți email la
Pentru cea mai recentă versiune, va rugam vizitați site-ul ArtMoney
Valoare
Caută
Filtrează
Numărul valorilor
Mai întâi alegeți procesul jocului
Acum începeți căutarea în acest proces
Rafinați căutarea până când numărul rezultatelor nu mai scade
Ne pare rău dar nu am găsit nimic. Va rugăm încercați din nou.
Dezactivat
Găsit
adrese
adrese
adresă
In tabel
Eroare la încărcare
Eroare la căutare
Eroare de filtrare
Formatul fișierului nu este suportat
Număr imposibil pentru acest tip
Nu pot încărca
Proces de căutare
Proces de filtrare
toate posibile
octet
octet
octeți
Metodă invalidă. Încercați altele.
sec
min
Nu ați ales niciun tip pentru această metodă
Dimensiunea tip nu poate fi mai mare decât
a fost schimbată
nu a fost schimbată
a fost incrementată
a fost decrementată
Această tabelă a fost creată cu o versiune mai nouă
Această tabelă este coruptă
Eroare de acces la fișier
Întreg 1 octet
Întreg 2 octeți
Întreg 3 octeți
Întreg 4 octeți
Întreg 8 octeți
Virgulă mobilă 4 octeți
Virgulă mobilă 6 octeți
Virgulă mobilă 8 octeți
Virgulă mobilă 10 octeți
Text
Șir cu terminator Nul
Șir vid
Șir Pascal
R.Întreg 2 octeți//R.=inveRs
R.Întreg 3 octeți
R.Întreg 4 octeți
R.Întreg 8 octeți
R.Virgulă mobilă 4 octeți
R.Virgulă mobilă 6 octeți
R.Virgulă mobilă 8 octeți
R.Virgulă mobilă 10 octeți
R.Text
R.Șir vid
R.Șir Pascal
Ianuarie
Februarie
Martie
Aprilie
Mai
Iunie
Iulie
August
Septembrie
Octombrie
Noiembrie
Decembrie
F//F=Îngheață
Ajutor
Despre
Alegeți procesul
Șterge
Încarcă
Salvează
Adaugă
Adaugă toate
Editează
Copiază
Șterge
Îngheață
Dezgheață
Aplică automat decalajul
Informații
Tipul de proces
Îngheață timp de (ms)
Frecventă de reîmprospătare (ms)
Limbă afișare
Afișează adresele
Tastă activare
General
Adițional
Personal
E-mail
Comentariu implicit
Sistem de operare
Format zecimal
Ordinea octeților
Prioritate scanare
Înaltă
Totală
Opțiuni
Anulare
Normal
Editează Adresa
Îngheață
Dimensiune
Adresă
Descriere
Tip
Invers
Valoare exactă
Secvență de valori
Plajă de valori
Valoare necunoscută
Valoare codată
Personalizare
Alegeți tip
Ordinea octeților
Normal și invers
TOATE
Întreg
Virgulă mobilă
Timp scurs:
Time rămas:
Viteză:
Găsit:
Joc
Comentariu
Dată
Sistem
Informații despre tabel
Creat de
Nume
Locație
Introducere secvență
Alegeți tasta pentru activare
Inversare
Căutați în acest bloc de memorie
Căutați în această plajă de adrese
Economisiți spațiul pe disc
de la
până la
Caută
Filtrează
Pas
Pas//Alegeți valoarea
Alegeți valoarea
Alegeți tot
AUTO
Arată procesul
Vizibil
Cu fereastră
Informații despre proces
Închide procesul
Arată fereastra
Ascunde fereastra
Sunteți siguri că doriți să închideți procesul?
Access respins
Imposibil de închis procesul
Nume fișier
Tip proces
Dimensiune date
Benchmark
Benchmark pentru determinarea vitezei de scanare a memoriei
Așteptați
Sistemul tău
Taste speciale
Adăugați la valoare
Blocați această fereastră
Activați Anularea/Refacerea filtrării
Vedere numere întregi
Fără semn
Cu semn
Anulați filtrarea
Refaceți filtrarea
Salvați filtrarea
Încărcați filtrarea
Pasul curent este
"Anularea filtrării" este dezactivată
"Refacerea filtrării" este dezactivată
"Încărcarea filtrării" este dezactivată
a fost incrementat cu
a fost decrementat cu
Interfață
Scurtătură
Scurtături activate
Scurtături implicite
Font fațadă
Font tabel
Culoare fațadă
Culoare editor
Culoare buton
Buton în formă de elipsă
OK
Editor memorie
Vedere în hexazecimal
Editare în hexazecimal
Numărul coloanelor cu valori
Vedere tip celula
Celula curentă
Deplasare
deplasare în rezultatele căutării
deplasare în tabel
deplasare in blocul de memorie
deplasare la adresă
Primul
Precedentul
Următorul
Ultimul
Total
Curent
Copiază zona
Inserează zona
Adaugă la tabel
Toate (standard)
Întregi (standard)
Virgulă mobilă (standard)
Inversează selecția
Aliniază coloanele
<NIMIC>
Pointer
Reîmprospătare
Editează selecția
Grup
Grup vizibil
Alegeți grupul
Salvează aceasta adresă/pointer
Aplică automat decalajul la toate
Aplică automat decalajul la grup
Aplică automat decalajul adresei de salvare la toate
Aplică automat decalajul adresei de salvare la grup
Comenzi cu pointeri
Aplică pointerul la toate
Aplică pointerul la grup
Aplică pointerul de salvare la toate
Aplică pointerul de salvare la grup
Aplică pointerul la această adresă
Aplică pointerul la adresa de salvare
Caută pointerul la această adresă
Caută pointerul la începutul blocului de memorie
Sortare
Sortează după descriere
Sortează după adresă
Sortează după valoare
Sortează după valoare ca text
Sortează după grup
Fuzionează
Eroare de fuzionare
Ambele tabele trebuie să fie create de același autor
Alegeți procesul curent
Set de caractere
Afișează panoul "Grup vizibil"
în grup
Convertește pointeri in adrese
Definește un filtru
Șir
<Fișier negăsit>
<Acces refuzat>
Editor de Fișier
Erori
<Dimensiunea a fost modificată>
Skin
Fără Skin
Editează fontul
Culoare tabel
Salvează o captură de memorie
După formulă
Proces
Oprește procesul
Continuă procesul
Salvează procesul
Încarcă procesul
ID Proces
Fire de execuție
Fișier(e)
Informații Fișier(e)
Alegeți Fișier
Alegeți Dosar
Număr de fișier(e)
Dimensiune totală
Deplasare în dosar
Obiect
Tabel
Ieșire
Rezultat
Mai multe
Cumpărați "ArtMoney Pro" online
Vizitați Site-ul
Manual ArtMoney
Codificare
Alegeți codificarea
Luminozitate
Saturație
Arată meniul principal
Folosiți plugin-uri de limbă neoficiale
Opriți procesul în timpul căutării
Salvează/Încarcă valori în fișierul-tabel
Bibliotecă pentru vizualizare proces
Opțiuni dosare
Mască nume fișier
Ora modificării
Data Fișier
Timp Fișier
Fără verificare
Ultimele 15 minute
Ultima ora
Ultima zi
Ultima lună
Ultimul an
Mai mult
Mai puțin
Această opțiune este disponibilă numai în ArtMoney Pro Edition
Numai în ArtMoney Pro
Contract de Licență
Sunt de acord cu termenii și condițiile Contractului de Licență
Despre Ediția PRO
Mulțumiri speciale
pentru designul manualului utilizator
pentru logo
pentru modulul de instalare
pentru crearea de icoane
pentru verificarea gramaticala a manualului în Engleză
pentru ajutor
pentru motorul de skin-uri (pachetul ThemeEngine)
pentru sfaturi și remarci
pentru traducere
pentru tabele
Număr de Înregistrare
Neînregistrat
Nu mai cere parola din nou
Numai pentru utilizatorul Windows curent
Oprește procesul și afișează ArtMoney
Continuă execuția procesului
Paranteză închisă superfluă
Paranteză închisă necesare
Ghilimele închise superflue
ID invalid
Număr invalid de argumente (M1,M2...)
Număr invalid de operații (-,+)
Număr invalid de condiții (<,>,=)
Număr invalid de expresii
Expresie invalidă
Acest pas nu există
Condiție invalidă
Parametru invalid pentru
Nu exista condiții
Căutare în curs
Înregistrare
Parola
Vă rugăm introduceți parola, apoi faceți click pe "OK"
Parola invalidă
Fișier de chei învechit sau invalid
Nu există fișier de chei
Implicit
Anulat de utilizator
Limba manualului
Proces negăsit sau inaccesibil
Reîmprospătați valorile din tabel doar când acesta este în prim plan
Dimensiunea codului
Harta procesului
Adresa regiunii
Statul
Protecție regiune
Protecție
Numele modulului
Această funcționalitate este disponibilă numai în Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Salvare/încărcare proces
Mod
Proces invalid. Procesul a fost modificat sau repornit.
Închide
În Excel
Rotunjire valori virgulă mobilă
Macromedia Flash
Plajă
Păstrează procesul în memorie
Dimensiunea memoriei fizice rezervate
Lansează un nou proces
Instalează
Creează o scurtătură pe desktop
Ascunde procesul
Afișează procesul
Emulator
Sistemul Jocului
Plajă de adrese
Folosește opțiunile emulatorului
Harta memorie emulator
Adresă.Emulator
Adresă PC
Doriți să convertiți adresele emulator în adrese PC?
Doriți să convertiți adresele PC în adrese emulator?
Eroare la conversia adreselor
Auto-detectarea emulatorului după numele fișierului
Grupuri
Afișează arborele de grupuri
Nimic
Stânga
Dreapta
Group Nou
Principal
Limbă
Doriți să ștergeți această limbă?
Doriți să adăugați o limbă nouă?
Doriți să modificați numele limbii?
Înghețare normală
se poate incrementa
se poate decrementa
între minim și maxim
Minim
Maxim
Copiază selecția
Descarcă "Spyware Process Detector"
"Spyware Process Detector" nu a fost găsit pe PC-ul dumneavoastră. Puteți sa îl descărcați și să îl instalați de pe site-ul companiei noastre: www.systemsoftlab.com. Programul poate funcționa împreună cu ArtMoney ca selector de procese. Folosind "Spyware Process Detector", puteți deschide orice proces ascuns și procese care împiedică deschiderea. Programul arată informații detaliate despre procesele care rulează pe PC-ul dumneavoastră și detectează spyware-uri noi, troieni și viruși (nedetectabili de soluția anti-virus pe care o utilizați dumneavoastră).
Trimiteți sugestii sau semnalați probleme la
Vizitați site-ul companiei si descărcați alte programe
Aceasta este o versiune gratuita LIMITATA. Puteți cumpăra versiunea completa pentru numai $24.90.
Numai utilizatorii înregistrați primesc suport tehnic complet și pot utiliza toate funcțiile programului.
Pentru a cumpăra, asigurați-vă că sunteți conectați la internet, dați click pe butonul Înregistrare online de mai jos.
Înregistrare online
Instalare Serviciu
Windows are nevoie să autentifice utilizatorul pentru a putea instala serviciul.
Instalați cu utilizatorul următor
Nume utilizator
Domeniu
Eroare la Instalarea Serviciului
Eroare de logare pentru utilizator
Mod ascuns
Ascunde procesul
Ascunde fereastra
Serviciul instalat este vechi. Vă rugăm restartați calculatorul pentru a instala noua versiune.
Tabelul s-a modificat
Doriți să salvați modificările?
Întreabă dacă doriți să salvați modificările înainte de a părăsi programul
Structura
Ignorate
Câmp
Dimensiunea structurii nu poate fi mai mare decât
Element
Element Nou
Caută structura tabelului
Caută structura grupului
Caută structura adreselor selectate
Deplasare în sus
Deplasare în jos
Obțineți "ArtMoney Pro" Gratuit
pentru verificarea gramaticală a manualului în limba Rusă
Tip de rotunjire
Rotunjește la cel mai apropiat
Rotunjește in jos
Rotunjește in sus
Rotunjește spre zero
Continuă
Obțineți Gratuit
Dezasamblează
Instrucțiune în limbaj de Asamblare
Folosește adresare pe module
Modul
Adresare pe module
Eroare de conversie
Nu pot converti adresa modulului: Modul inexistent în proces.
Scanează zona de memorie a modulelor sistem
Scanează zona de memorie a modulelor partajate
Eroare la deschidere proces
Deschidere proces imposibila
Încearcă să utilizezi versiunea PRO.
Pentru acest tabel aveți nevoie de versiunea PRO
Registru invalid
Adresă invalidă
Valoare invalidă
Valoarea este prea mare
Instrucțiune în limbaj de asamblare invalidă
Lansați ArtMoney ca administrator o singura dată. Faceți click-dreapta pe icoana ArtMoney și alegeți "Lansare ca administrator" din meniul contextual.
Eroare la pornire serviciu
Eroare la deschidere serviciu
Încercați sa reporniți calculatorul
a fost schimbat de
Conversia tabelului
Doriți sa convertiți tabelul la 64 biți?
Doriți sa convertiți tabelul la 32 biți?
Eroare de conversie. Programul nu poate converti adresele la 32 biti.
Multiplul adresei//Divizibilitatea adresei
Par//Divizibil cu 2
Impar
Multiplu de 4//Divizibil cu 4
Multiplu de 8//Divizibil cu 8
Multiplu de 16//Divizibil cu 16
Scanează doar adresele statice din module
Afișează opțiunile modulului
Introduceți codul de înregistrare
Va rugăm sa inserați codul dumneavoastră de înregistrare (folosiți combinația de taste Ctrl-V sau faceți click pe butonul "Paste"), apoi faceți click pe butonul "OK"
Lipește
Codul de înregistrare este invalid
Codul de înregistrare este valid doar pentru versiunea în limba engleză
Codul de înregistrare este valid doar pentru versiunea în limba rusă
Codul de înregistrare este valid doar pentru versiunea veche
Codul de înregistrare nu mai funcționează. Vă rugăm să contactați departamentul vânzări la sales@systemsoftlab.com pentru a obține un nou cod de înregistrare
Dacă nu vedeți numele și datele dumneavoastră aici, înseamnă ca folosiți o versiune piratată și această versiune poate funcționa incorect!
Pointer la Pointer
Decalaj Maxim
Nivel de
Caută pointerul la Pointer
Maxim 2 nivele in ediția SE!
Încercați sa dezactivați obligativitatea semnării driverelor
Modul rapid (folosește mai multă memorie)
Mb
Aplica decalajul automat și copiază ca grup nou
Adresa in bloc
Nu pot converti adresa in bloc: Acest bloc nu exista in proces.
Problema de conversie: Dimensiunea blocului nu este unică.
Sortează pointerii după decalaj
Ascunde textul pentru modul ascuns complet//doar VIP
Cumpără sau Vinde Conturi de Jocuri Online
O nouă versiune este disponibilă pentru descărcare
Verifică dacă există versiuni mai noi
Pointer cu decalaj
Caută pointerul cu decalajul maxim disponibil
disponibil din 2 pași
Formula
Versiune
Întotdeauna deasupra celorlalte ferestre
Activează funcția "Întotdeauna deasupra celorlalte ferestre"
Dezactivează funcția "Întotdeauna deasupra celorlalte ferestre"
Verificați conexiunea la internet! Nu pot deschide systemsoftlab.com
Încercați sa definiți opțiunea
Nume/Modul
Cod Hexa
Registru
Fanion
Atașează Debugger-ul
Detașează Debugger-ul
Doriți sa atașați debugger-ul la procesul selectat?
Lista Breakpoint-urilor
Comenzi
Debug
Salvează informația pentru debugging
Încarcă informația pentru debugging
Limbaj de asamblare
x86-32 biți
x86-64 biți
Breakpoint
Adaugă breakpoint
Șterge breakpoint
Lansează
Lansează până
Până la ret
Trace un pas
Trace pasul următor
Definiți numele adresei
Ștergeți numele adresei
Da
Nu
Tipul debugger-ului
Standard
Tratarea excepțiilor
Tratarea breakpoint-urilor
Software (instrucțiunea int3)
int3
Regiștri Debug (max 4)
regiștri
Excepții de pagina
excepții
Tipul de breakepoint de acces
Întreabă când se atașează debugger-ul la proces
Folosește breakpoint-uri software dacă toți regiștrii de debug sunt utilizați
Salvare/Încărcare automata a informațiilor de debug
Folosește simboluri debug
Cale de acces pentru simbol
Activează
Întrerupe
Execută
Orice acces
Scriere
Condiții
Modificări
Activează TOATE
Dezactivează TOATE
Găsește instrucțiunea care accesează adresa
La accesarea memoriei
La scrierea memoriei
Condiții eronate
Modificări eronate
Diviziune cu zero
Eroare de citire
Eroare de scriere
Partea stângă greșită
Start
Stop
Acces
Șterge rezultat
Împarte la fire
Număr
Fire
8-biți
16-biți
32-biți
Hexa//hexazecimal dim max 11
Hexa//hexazecimal scurt dim max 5
VirgulaMobila4
VirgulaMobila8
Secvență Hexa
Serverul systemsoflab.com nu răspunde sau nu există conexiune la internet
Codul de înregistrare este black-listat
Puteți activa acest cod de maxim 2 ori pe zi
Codul de înregistrare este potrivit pentru ediția VIP
Ascunde prezența debugger-ului
Salveză tabelul în format unicode
Obține dimensiunea până la sfârșitul funcției (până la return)
Licențe
Scanează regiunile de memorie
date modificabile
date care pot fi doar citite
code modificabil
code care poate fi doar citit
partajat
sistem
protejat
ascuns
Multiplicitate a fiecărei adrese
Lista numelor de adrese și a simbolurilor
Simboluri de dosare
Nume de utilizatori
Atenție la litere mari/mici (case-sensitive)
Cuvinte întregi
Prima poziție
Citire/Scriere
Detectarea automată a dimensiunii funcțiilor
Ascunde regiștrii de debugging
Patch-uiește/modifică această funcție (structură)
Faceți bypass la protecția procesului
Folosiți propriile funcții pentru accesarea memoriei
Funcții mod utilizator (atașate la proces)
Funcții mod kernel (prin intermediul unui driver)
Atașare la proces fără OpenProcess
Semnături
Caută semnătura
Adaugă semnătura
Decalaj
Căutare automată
Căutare statică
Regiuni
Modifică in cod de asamblare
Ca si cod de asamblare
Convertește în HEX
Limitează decalajele unice pe nivel
Înlocuirea codului
Înlocuiește codul
Înlocuiește toate codurile simultan
<ÎNLOCUIT>
<NEÎNLOCUIT>
<FĂRĂ MODUL>
<FĂRĂ BLOC>
<FĂRĂ SEMNĂTURĂ>
<FĂRĂ VARIABILĂ>
Injectare cod
Injectează codul
Numai după înlocuirea cu succes a codului
Înlocuiește automat toate codurile si injectează
Permite înlocuirea automata a tuturor codurilor si injectarea
Cere permisiunea pentru înlocuirea automată a codurilor si injectare
Tabela conține un cod pentru injectare și înlocuire. Poate fi cod malițios! Descărcați tabele doar de pe site-uri în care aveți încredere! Doriți să injectați codul in proces?
Înlocuiește toate codurile și injectează
Anulează înlocuirea codului și injectarea
Semnătura
Semnătura Originală
Semnătura originală incorectă
Adresa completă a semnăturii//complet
Adresa scurtă a semnăturii//scurt
Adresa completă a variabilei/label//complet
Adresa variabilei//scurt
Nu se poate converti adresa semnăturii: semnătura inexistentă.
Nu se poate converti adresa variabilei: variabila inexistentă.
Nume//variablă sau denumire
Dimensiunea codului pentru înlocuire
O instrucțiune în limbaj de asamblare
Mai multe instrucțiuni în limbaj de asamblare
Linie
Eroare de adresare relativă (decalajul/offset-ul este prea mare)
Multiplicator invalid
Eroare la JMP-ul înapoi spre codul jocului//Return jmp error (jmp to original game code)
Imposibil de alocat memorie
Zone//Zone memorie
Definiți adresa în oglindă
Ștergeți adresa în oglindă
din adresa minima
Service
Afișează decalajul/offset-ul pointerului in hexazecimal
Folosește registrul RAX(EAX). Numai instrucțiunea MOV cu registrul RAX(EAX) poate citi/scrie o adresă absolută!
Modifică viteza procesului
Viteza dumneavoastră (%)
Normal//Speedd
Eroare la modificarea vitezei procesului
Crește viteza procesului
Scade viteza procesului
Stivă
Vizualizează ca stivă
Salvează stiva de fire (de execuție)
Adresă de întoarcere
Parametru
Parametrii
Afișează toți parametrii într-o singură linie
Adresa de întoarcere numai în modul
Eroare la citirea din memorie
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D0217763